# #todo:Создайте программу, которая будет выводить все возможные комбинации при броске 2 игральных костей
# и сумму их значений. У игральной кости стороны пронумерованы от 1 до 6.
#
# Пример вывода:
# Сумма 2   комбинация [(1,1)]
# Сумма 3   комбинация [(1,2),(2,1)]
# Сумма 4   комбинация [(1,3),(3,1),(2,2)]
# ........................................
# Выводы комбинаций оформить в список кортежей.
comb = list()
k = 2
flag = 0
while k < 13:
    for i in list(range(1, 7)):
        for j in list(range(i, 7)):
            if (i+j) == k:
                if i == j and flag == 1:
                    continue
                if i == j and flag == 0:
                    comb.append((i, j))
                    flag = 1
                if i != j:
                    comb.append((i, j))
                    comb.append((j, i))
            if i == 6 and j == 6:
                print("Sum", k, "combination", comb)
            flag = 0
    comb = list()
    k = k+1
